app/controllers/articulos_controller.rb

SELECT "articulos".* FROM "articulos"
---
  def index
    @articulos = Articulo.all

SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show(*args)
    @articulo = Articulo.find(params[:id])

INSERT INTO "articulos" ("titular", "contenido", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titular", "1"], ["contenido", "1"], ["created_at", "2017-07-18 04:15:13.153495"], ["updated_at", "2017-07-18 04:15:13.153495"]]
---
  def create(*args)

    puts "Ejecutando create..!"
    #render plain: params[:articulo].inspect
    @articulo = Articulo.new(articulo_params)
    if @articulo.save